-- Find the roll number of all male students, having their department building in ‘Block 2’.
-- (Database: LIS)

select students.roll_no from students 
	natural join departments
		where students.gender = 'M' and departments.department_building = 'Block_2'

-- Find the first name, last name and the roll number of students having their department
-- building in ‘Block 1’. (Database: LIS)

select student_fname , student_lname , roll_no from students 
	natural join departments
		where department_building = 'Block_1'

-- Find out the details of the members who have not issued any books. (Database: LIS)

select * from members left join book_issue on members.member_no = book_issue.member_no where book_issue  is null

SELECT * FROM members
WHERE NOT EXISTS (SELECT *
FROM book_issue
WHERE members.member_no = book_issue.member_no)

-- Find out the name of courses which have been taught in both Fall semester and Spring
-- semester. (Database: University)




SELECT title
FROM course 
WHERE course_id IN ((SELECT course_id
FROM section
WHERE semester = 'Fall')
INTERSECT
(SELECT course_id
FROM section
WHERE semester = 'Spring'))

-- Write a SQL statement to find out the number of students who have studied in each
-- building from 2005 till 2008 (including 2005,2008). (Database: University)

select section.building , count(distinct takes.id) from takes  natural join section where takes.year between 2004 and 2009 group by section.building 

SELECT COUNT(DISTINCT st.id), building
FROM section AS se, takes AS t, student AS st
WHERE st.id = t.id
AND t.course_id = se.course_id
AND t.sec_id = se.sec_id
AND t.semester = se.semester
AND t.year = se.year
AND (t.year >= 2005 AND t.year <= 2008)
GROUP BY building